# vim:ft=ruby

if OS.mac?
  tap "davidnussio/homebrew-cask"
  tap "lotyp/homebrew-formulae"

  # OS specific tools
  brew "noti" # Notification tool
  brew "mas" # Mac App Store CLI
  brew "lotyp/formulae/dockutil" # Dock management tool
  brew "watch" # Watch command

  # Apps
  cask "google-chrome@beta" # Web browser
  cask "chatgpt" # AI assistant
  cask "protonvpn" # VPN service
  cask "raycast" # Productivity tool
  # cask "ps-pulse" # VPN client (commented out)
  cask "microsoft-teams" # Communication tool
  cask "zoom" # Video conferencing
  cask "dbeaver-community" # Database management tool
  cask "mongodb-compass" # MongoDB GUI
  # cask "appflowy" #
  cask "notion" # Note-taking app
  cask "hiddenbar" # Menu bar manager
  cask "discord" # Chat app
  cask "vmware-horizon-client" # VDI client
  cask "notunes" # Prevent iTunes from opening
  cask "ghostty" # Ghost terminal
  cask "localsend" # Local file sharing
  cask "balenaetcher" # Flash OS images
  cask "lm-studio" #


  # Dev Tools
  cask "visual-studio-code" # Code editor
  cask "devtoys" # Developer utilities

  # Fonts
  cask "font-fira-code" # Programming font
  cask "font-symbols-only-nerd-font" # Nerd font symbols
  cask "font-jetbrains-mono" # Programming font
  cask "font-recursive-code" # Programming font
  cask "font-monaspace" # Monospaced font

end

# Command-line tools
brew "git" # Version control
brew "gh" # GitHub CLI
brew "fish" # Friendly interactive shell
brew "fisher" # Fish shell plugin manager
brew "starship" # Shell prompt
brew "mise" # Shell environment manager
brew "neovim" # Text editor
brew "httpie" # HTTP client
brew "stow" # Dotfile manager
brew "zoxide" # Directory jumper
brew "bat" # Cat clone with syntax highlighting
brew "eza" # Modern ls
brew "fd" # Find alternative
brew "ripgrep" # Grep alternative
brew "jq" # JSON processor
brew "fzf" # Fuzzy finder
brew "tmux" # Terminal multiplexer
brew "tldr" # Simplified man pages
brew "golang" # Go programming language
brew "colima" # Container runtime
brew "docker" # Container runtime
brew "podman" # Container runtime
brew "kubectl" # Kubernetes CLI
brew "croc" # Secure file transfer
brew "vercel-cli" # Vercel CLI
brew "firebase-cli" # Firebase CLI
brew "yt-dlp" # YouTube downloader
brew "ffmpeg" # Multimedia framework
brew "luarocks" # Lua package manager
